TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0H3216/driverlib/empty_driverlib_src/ti/driverlib/dl_rtc_common.h
/**
 *  @brief      Get the hours in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The hours of alarm 2
 *
 *  @retval            Value in range: 0-23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm2HoursBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->A2HOUR & RTC_A2HOUR_AHOURBIN_MASK);
}

/**
 *  @brief      Enable day of the week in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm2DayOfWeekBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A2DAY |= RTC_A2DAY_ADOWAE_ENABLE;
}

/**
 *  @brief      Disable day of the week in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm2DayOfWeekBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A2DAY &= ~(RTC_A2DAY_ADOWAE_MASK);
}

/**
 *  @brief      Set the day of the week in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  day    Value for the day of the week of the RTC Common calendar
 *                     Valid values are 0-6
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm2DayOfWeekBinary(
    RTC_Regs *rtc_common, uint8_t day)
{
    DL_Common_updateReg(&rtc_common->A2DAY, day, RTC_A2DAY_ADOW_MASK);
}

/**
 *  @brief      Get the day of the week in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The day of the week in the RTC Common calendar
 *
 *  @retval            Value in range: 0-6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm2DayOfWeekBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->A2DAY & RTC_A2DAY_ADOW_MASK);
}

/**
 *  @brief      Enable day of the month in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm2DayOfMonthBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A2DAY |= RTC_A2DAY_ADOMAEBIN_ENABLE;
}

/**
 *  @brief      Disable day of the month in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm2DayOfMonthBinary(
    RTC_Regs *rtc_common)
{
    rtc_common->A2DAY &= ~(RTC_A2DAY_ADOMAEBIN_MASK);
}

/**
 *  @brief      Set the day of the month in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  day    Value for the day of the month of the RTC Common calendar
 *                     Valid values are 1-31
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm2DayOfMonthBinary(
    RTC_Regs *rtc_common, uint8_t day)
{
    DL_Common_updateReg(&rtc_common->A2DAY,
        (uint32_t) day << RTC_A2DAY_ADOMBIN_OFS, RTC_A2DAY_ADOMBIN_MASK);
}

/**
 *  @brief      Get the day of the month in binary for RTC Common Calendar Alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The day of the month in the RTC Common calendar
 *
 *  @retval            Value in range: 1-31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm2DayOfMonthBinary(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(
        (rtc_common->A2DAY & RTC_A2DAY_ADOMBIN_MASK) >> RTC_A2DAY_ADOMBIN_OFS);
}

/**
 *  @brief      Set prescale interrupt interval for timer 0 and 1
 *
 *  Set prescale timer interrupt interval to DL_RTC_COMMON_PRESCALE_NONE to keep the
 *  timer disabled.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @param[in]  prescaler0Divider    Value to set for prescaler 0
 *                                       interrupt interval
 *                                       One of @ref DL_RTC_COMMON_PRESCALER0_DIVIDE
 *
 *  @param[in]  prescaler1Divider    Value to set for prescaler 1
 *                                       interrupt interval
 *                                       One of @ref DL_RTC_COMMON_PRESCALER1_DIVIDE
 *  @param[in]  prescaler2Divider    Value to set for prescaler 2
 *                                   interrupt interval.
 *                                   One of @ref DL_RTC_COMMON_PRESCALER2_DIVIDE
 */
__STATIC_INLINE void DL_RTC_Common_setPrescalerEvents(RTC_Regs *rtc_common,
    DL_RTC_COMMON_PRESCALER0_DIVIDE prescaler0Divider,
    DL_RTC_COMMON_PRESCALER1_DIVIDE prescaler1Divider,
    DL_RTC_COMMON_PRESCALER2_DIVIDE prescaler2Divider)
{
    rtc_common->PSCTL =
        (((uint32_t) prescaler0Divider & RTC_PSCTL_RT0IP_MASK) |
            ((uint32_t) prescaler1Divider & RTC_PSCTL_RT1IP_MASK));
    rtc_common->EXTPSCTL =
        ((uint32_t) prescaler2Divider & RTC_EXTPSCTL_RT2PS_MASK);
}

/**
 *  @brief      Set periodic alarm 0
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @param[in]  prescaler0Divider  Value to set for prescaler 0 interrupt
 *                                 interval. One of @ref DL_RTC_COMMON_PRESCALER0_DIVIDE
 *
 */
__STATIC_INLINE void DL_RTC_Common_setPeriodicAlarm0(
    RTC_Regs *rtc_common, DL_RTC_COMMON_PRESCALER0_DIVIDE prescaler0Divider)
{
    DL_Common_updateReg(&rtc_common->PSCTL, (uint32_t) prescaler0Divider,
        RTC_PSCTL_RT0IP_MASK);
}

/**
 *  @brief      Set periodic alarm 1

 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @param[in]  prescaler1Divider  Value to set for prescaler 1 interrupt
 *                                 interval. One of @ref DL_RTC_COMMON_PRESCALER1_DIVIDE
 */
__STATIC_INLINE void DL_RTC_Common_setPeriodicAlarm1(
    RTC_Regs *rtc_common, DL_RTC_COMMON_PRESCALER1_DIVIDE prescaler1Divider)
{
    DL_Common_updateReg(&rtc_common->PSCTL, (uint32_t) prescaler1Divider,
        RTC_PSCTL_RT1IP_MASK);
}

/**
 *  @brief      Set periodic alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @param[in]  prescaler2Divider  Value to set for prescaler 2 interrupt
 *                                 interval. One of @ref DL_RTC_COMMON_PRESCALER2_DIVIDE
 */
__STATIC_INLINE void DL_RTC_Common_setPeriodicAlarm2(
    RTC_Regs *rtc_common, DL_RTC_COMMON_PRESCALER2_DIVIDE prescaler2Divider)
{
    DL_Common_updateReg(&rtc_common->EXTPSCTL, (uint32_t) prescaler2Divider,
        RTC_EXTPSCTL_RT2PS_MASK);
}

/**
 *  @brief      Get prescaler 0 interrupt interval
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            Value for prescaler 0 interrupt interval
 *
 *  @retval            One of @ref DL_RTC_COMMON_PRESCALER0_DIVIDE
 *
 */
__STATIC_INLINE DL_RTC_COMMON_PRESCALER0_DIVIDE DL_RTC_Common_getPrescaler0(
    const RTC_Regs *rtc_common)
{
    uint32_t prescaler = (rtc_common->PSCTL & RTC_PSCTL_RT0IP_MASK);

    return (DL_RTC_COMMON_PRESCALER0_DIVIDE)(prescaler);
}

/**
 *  @brief      Get prescaler 1 interrupt interval
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            Value for prescaler 1 interrupt interval
 *
 *  @retval            One of @ref DL_RTC_COMMON_PRESCALER1_DIVIDE
 */
__STATIC_INLINE DL_RTC_COMMON_PRESCALER1_DIVIDE DL_RTC_Common_getPrescaler1(
    const RTC_Regs *rtc_common)
{
    uint32_t prescaler = (rtc_common->PSCTL & RTC_PSCTL_RT1IP_MASK);

